Title: Working with Datetimes
Slug: sql/working-with-datetimes
Category: SQL
Tags: SELECT, FROM, LIMIT, to_char
Date: 2017-08-27
Modified: 2017-08-27

#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Convert datetimes to other formats
Below are examples of different date formats followed by time formats. They can all be mixed and matched to get the format you need.

In [30]:
%%sql

SELECT
    p.payment_id
    , p.payment_date
    , to_char(p.payment_date, 'YY-MM-DD')
    , to_char(p.payment_date, 'DD Month YYYY')
    , to_char(p.payment_date, 'Dy DDth Mon')
    -- Year followed by week number
    , to_char(p.payment_date, 'YYYY-"W"IW')
FROM
    payment p
LIMIT
    5

[(17503, datetime.datetime(2007, 2, 15, 22, 25, 46, 996577), '07-02-15', '15 February  2007', 'Thu 15th Feb', '2007-W07'),
 (17504, datetime.datetime(2007, 2, 16, 17, 23, 14, 996577), '07-02-16', '16 February  2007', 'Fri 16th Feb', '2007-W07'),
 (17505, datetime.datetime(2007, 2, 16, 22, 41, 45, 996577), '07-02-16', '16 February  2007', 'Fri 16th Feb', '2007-W07'),
 (17506, datetime.datetime(2007, 2, 19, 19, 39, 56, 996577), '07-02-19', '19 February  2007', 'Mon 19th Feb', '2007-W08'),
 (17507, datetime.datetime(2007, 2, 20, 17, 31, 48, 996577), '07-02-20', '20 February  2007', 'Tue 20th Feb', '2007-W08')]

In [43]:
%%sql

SELECT
    p.payment_id
    , p.payment_date
    , to_char(p.payment_date, 'HH24:MI:SS:US')
    , to_char(p.payment_date, 'HH:MI:SS AM')
    , to_char(p.payment_date, 'HH:MI a.m.')
FROM
    payment p
LIMIT
    5

[(17503, datetime.datetime(2007, 2, 15, 22, 25, 46, 996577), '22:25:46:996577', '10:25:46 PM', '10:25 p.m.'),
 (17504, datetime.datetime(2007, 2, 16, 17, 23, 14, 996577), '17:23:14:996577', '05:23:14 PM', '05:23 p.m.'),
 (17505, datetime.datetime(2007, 2, 16, 22, 41, 45, 996577), '22:41:45:996577', '10:41:45 PM', '10:41 p.m.'),
 (17506, datetime.datetime(2007, 2, 19, 19, 39, 56, 996577), '19:39:56:996577', '07:39:56 PM', '07:39 p.m.'),
 (17507, datetime.datetime(2007, 2, 20, 17, 31, 48, 996577), '17:31:48:996577', '05:31:48 PM', '05:31 p.m.')]

There are many ways that datetimes can be converted in Postgres. For more examples, [see the docs](https://www.postgresql.org/docs/current/static/functions-formatting.html).